Revit 2026 API

# VectorAtPoint(VectorAtPoint) Constructor

---

Creates a copy of the given VectorAtPoint instance.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public VectorAtPoint(
	VectorAtPoint otherObject
)
```
```vb
Public Sub New (
	otherObject As VectorAtPoint
)
```
```cpp
public:
VectorAtPoint(
	VectorAtPoint^ otherObject
)
```
```fsharp
new :
        otherObject : VectorAtPoint -> VectorAtPoint
```

#### Parameters

otherObject VectorAtPoint

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

VectorAtPoint Class

VectorAtPoint Overload

Autodesk.Revit.DB.Analysis Namespace